EliottLacommeRuiz/Ultra-Low-Power-STM32-Based-Flight-Characterization-System---Summer-Grant/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
uint8_t Imu_Reg16_Read(uint8_t addr, uint8_t* low_byte, uint8_t* high_byte);
uint8_t Imu_Reg16_Write(uint8_t addr, uint8_t low_instruction_byte, uint8_t high_instruction_byte);

void Imu_Stop_Transmission(void);
void Imu_Start_Transmission(void);
void Imu_SetUp(void);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define FLASH_CS_Pin GPIO_PIN_0
#define FLASH_CS_GPIO_Port GPIOA
#define FLASH_HOLD_RST_Pin GPIO_PIN_1
#define FLASH_HOLD_RST_GPIO_Port GPIOA
#define FLASH_WP_Pin GPIO_PIN_2
#define FLASH_WP_GPIO_Port GPIOA
#define IMU_NCS_Pin GPIO_PIN_0
#define IMU_NCS_GPIO_Port GPIOB
#define IMU_INT1_Pin GPIO_PIN_1
#define IMU_INT1_GPIO_Port GPIOB
#define LED_YELLOW_Pin GPIO_PIN_5
#define LED_YELLOW_GPIO_Port GPIOB
#define LED_GREEN_Pin GPIO_PIN_6
#define LED_GREEN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
#define IMU_REG_CHIP_ADDR 0x00
#define IMU_REG_CHIP_ID 0x43
#define IMU_ERR_ADDR 0x01
#define IMU_STATUS_ADDR 0x02

#define IMU_ACCEL_CONFIG_ADDR 0x20
#define IMU_ACCEL_LOW_POWER_CONFIG_LOW 0x31
#define IMU_ACCEL_LOW_POWER_CONFIG_HIGH 0x27

#define IMU_GYRO_CONFIG_ADDR 0x21
#define IMU_GYRO_CONFIG_LOW 0x4B
#define IMU_GYRO_CONFIG_HIGH 0x40


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
